
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * module.fis-ds-web-session-storage.azurerm_redis_cache.redis
  * module.fis-ds-web-session-storage.azurerm_resource_group.cache-resourcegroup
* Update
  * azurerm_key_vault_secret.redis_access_key
* Delete
  * module.sptribs-frontend-session-storage.azurerm_redis_cache.redis
  * module.sptribs-frontend-session-storage.azurerm_resource_group.cache-resourcegroup


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_access_key" {
        id           = "https://sptribs-aat.vault.azure.net/secrets/redis-access-key/d149ac78be184d0f96e1f9f1869e701c"
        key_vault_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat"
        name         = "redis-access-key"
        tags         = {}
      ~ value        = (sensitive value)
        version      = "d149ac78be184d0f96e1f9f1869e701c"
    }

  # module.fis-ds-web-session-storage.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "sptribs-frontend-session-storage-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "sptribs-frontend-session-storage-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/sptribs-frontend.git"
          + "application"         = "special-tribunals"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#special-tribunals-dev-channel"
          + "environment"         = "staging"
          + "managedBy"           = "Special Tribunals"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 300
          + maxmemory_delta                 = 200
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 200
        }
    }

  # module.fis-ds-web-session-storage.azurerm_resource_group.cache-resourcegroup will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "sptribs-frontend-session-storage-cache-aat"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/sptribs-frontend.git"
          + "application"         = "special-tribunals"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#special-tribunals-dev-channel"
          + "environment"         = "staging"
          + "managedBy"           = "Special Tribunals"
        }
    }

  # module.sptribs-frontend-session-storage.azurerm_redis_cache.redis will be destroyed
  - resource "azurerm_redis_cache" "redis" {
      - capacity                      = 1 -> null
      - enable_non_ssl_port           = false -> null
      - family                        = "P" -> null
      - hostname                      = "sptribs-frontend-session-storage-aat.redis.cache.windows.net" -> null
      - id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-frontend-session-storage-cache-aat/providers/Microsoft.Cache/Redis/sptribs-frontend-session-storage-aat" -> null
      - location                      = "uksouth" -> null
      - minimum_tls_version           = "1.2" -> null
      - name                          = "sptribs-frontend-session-storage-aat" -> null
      - port                          = 6379 -> null
      - primary_access_key            = (sensitive value)
      - primary_connection_string     = (sensitive value)
      - private_static_ip_address     = "10.96.132.52" -> null
      - public_network_access_enabled = true -> null
      - resource_group_name           = "sptribs-frontend-session-storage-cache-aat" -> null
      - secondary_access_key          = (sensitive value)
      - secondary_connection_string   = (sensitive value)
      - sku_name                      = "Premium" -> null
      - ssl_port                      = 6380 -> null
      - subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sptribs-frontend.git"
          - "application"         = "special-tribunals"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#special-tribunals-dev-channel"
          - "environment"         = "staging"
          - "managedBy"           = "Special Tribunals"
        } -> null

      - redis_configuration {
          - aof_backup_enabled              = false -> null
          - enable_authentication           = true -> null
          - maxclients                      = 7500 -> null
          - maxfragmentationmemory_reserved = 642 -> null
          - maxmemory_delta                 = 642 -> null
          - maxmemory_policy                = "volatile-lru" -> null
          - maxmemory_reserved              = 642 -> null
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
        }
    }

  # module.sptribs-frontend-session-storage.azurerm_resource_group.cache-resourcegroup will be destroyed
  - resource "azurerm_resource_group" "cache-resourcegroup" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-frontend-session-storage-cache-aat" -> null
      - location = "uksouth" -> null
      - name     = "sptribs-frontend-session-storage-cache-aat" -> null
      - tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/sptribs-frontend.git"
          - "application"         = "special-tribunals"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#special-tribunals-dev-channel"
          - "environment"         = "staging"
          - "managedBy"           = "Special Tribunals"
        } -> null
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":175,"Program":"tfcmt","SHA1":"","Vars":{}} -->